
{
    "nav1":"A propos",
    "nav2":"Projets",
    "nav3":"Contact",

    "hero_title":"Bonjour, Lucile developpeur web",
    "hero_text":"Toujours à la recherche de nouveaux challenges, j'ai débuté par l'apprentissage de Javascript mais j'ai très vite éprouvé un grand intérêt pour React et j'ai donc obtenu mon diplôme de developpeur web cependant je ne compte pas m'arrêter la ! Concevoir un site, partant de quelques idées sur un morceau de papier puis faire des maquettes pour enfin le voir prendre forme est un vrai plaisir. J'aime ajouter des petits détails pour faire de chaque site une pièce unique.",
    "hero_link":"Contactez-moi",
    "hero_link_text":"et parlons de votre projet !",

    "compet_title":"Compétences",
    "compet_text":"D'autres compétences à venir !",

    "projet_title":"Projets",
    "projet_text":"Voici mes projets réalisés à ce jour, et ceux en cours de réalisation. Retrouvez le lien vers le site ou bien le gitHub pour en apprendre plus sur chaque projet.",
   
    "btn-tous":"Tous",
    "btn-plus":"Voir plus",
    "btn-moins":"Voir moins",
   
    "cv_title":"CV",
    "cv_text":"Pour tout connaître de mon parcours, téléchargez mon Cv !",

    "contact_title":"Contact",
    "contact_text1":"une idée ?",
    "contact_text2":"un projet ?",
    "contact_text3":"une information ?",
    "contact_text4":" N'hesitez pas et contactez moi !",
    "input_name": "Nom",
    "btn-envoyer": "Envoyer",
    "btn-succes":"Votre message à bien été envoyé. je reviendrais vite vers vous !",
    "btn-error-send":"Une erreur s'est produite lors de l'envoi du formulaire.",
    "btn-error-form":"Veuillez remplir tous les champs afin que je puisse vous re-contacter",

    "modal-lien-git":"Lien vers GitHub",
    "modal-lien-site":"Lien vers le site",

    "projet.1.titre": "Application web de location immobilière avec React",
    "projet.1.description":"Refonte totale du site pour passer à une stack complète en JavaScript avec NodeJS côté back-end, et React côté front-end. Développement de l'ensemble de l'application, les composants React, les routes React Router, en suivant les maquettes Figma (responsives). Les données sont récupérées dynamiquement depuis un fichier JSON. Les animations sont réalisés avec SASS",

    "projet.2.titre": "Page web dynamique avec Javascript",
    "projet.2.description":"Site web d'une photographe professionelle. Comprenant une page de présentation de ses projets récupérer depuis une API (Swagger) et qui peuvent être trier grâce à un filtre, une page de connexion de l'administrateur du site, une modal permettant d'ajouter de nousveaux projet et de les stocker et une modal permettant de les supprimer. ",

    "projet.3.titre": "Page d'accueil d'une agence de voyage",
    "projet.3.description":"Developpement de la page d'accueil en HTML et CSS. Page responsive selon les maquettes figma en desktop, tablette et mobile.",

    "projet.4.titre": "Site mobile avec animation ",
    "projet.4.description":"Site de restauration gastronomique en mobile first. 4 menus sont disponibles et il est possible de marquer sa préférence grâce à l'icône de coeur. Au clic des menu les plats apparaissent avec une animation faite en SASS. Une animation simulant un loading est présente au chargement. ",

    "projet.5.titre": "Optimisez le référencement d'un site de photographe",
    "projet.5.description":"Site pour montrer le traval d'un photographe professionelle comportant des soucis d'optimisation entrainant des problèmes pour les utilisateurs. j'ai donc réalisé : une optimisation globale du site tant sur les performances que sur le SEO, la mise en place du référencement local en utilisant Schema.org, l'ajout des metas pour les réseaux sociaux, l'optimisation de l'accessibilité du site et enfin j'ai consigné toutes les modifications apportés dans un rapport d'optimisation.",

    "projet.6.titre": "Débugger le site d'une agence d'événementiel",
    "projet.6.description":"Le site à été commencé par un developpeur qui à dû partir. Le site est fonctionnel, mais quelques bugs entravent le bon usage par les visiteurs. J'ai donc réalisé des tests (intégrations, unitaires, end-to-end) afin de corriger les bugs et éviter de futur problèmes. J'ai aussi réalisé un cahier de recette. "


}


