
{
    "nav1":"A propos",
    "nav2":"Projets",
    "nav3":"Contact",

    "hero_title":"Bonjour, Lucile developpeur web",
    "hero_text":"Toujours à la recherche de nouveaux challenges, j'ai débuté par l'apprentissage de Javascript mais j'ai très vite éprouvé un grand intérêt pour React et j'ai donc obtenu mon diplôme de developpeur web cependant je ne compte pas m'arrêter la ! Concevoir un site, partant de quelques idées sur un morceau de papier puis faire des maquettes pour enfin le voir prendre forme est un vrai plaisir. J'aime ajouter des petits détails pour faire de chaque site une pièce unique.",
    "hero_link":"Contactez-moi",
    "hero_link_text":"et parlons de votre projet !",

    "compet_title":"Compétences",
    "compet_text":"D'autres compétences à venir !",

    "projet_title":"Projets",
    "projet_text":"Voici mes projets réalisés à ce jour, et ceux en cours de réalisation. Retrouvez le lien vers le site ou bien le gitHub pour en apprendre plus sur chaque projet.",
   
    "btn-tous":"Tous",
    "btn-plus":"Voir plus",
    "btn-moins":"Voir moins",
   
    "cv_title":"CV",
    "cv_text":"Pour tout connaître de mon parcours, téléchargez mon Cv !",

    "contact_title":"Contact",
    "contact_text1":"une idée ?",
    "contact_text2":"un projet ?",
    "contact_text3":"une information ?",
    "contact_text4":" N'hesitez pas et contactez moi !",
    "input_name": "Nom",
    "btn-envoyer": "Envoyer",
    "btn-succes":"Votre message à bien été envoyé. je reviendrais vite vers vous !",
    "btn-error-send":"Une erreur s'est produite lors de l'envoi du formulaire.",
    "btn-error-form":"Veuillez remplir tous les champs afin que je puisse vous re-contacter",

    "modal-qui":"Le client :",
    "modal-description":"Le projet",
    "modal-objectif":"Objectif",
    "modal-lien-git":"Lien vers GitHub",
    "modal-lien-site":"Lien vers le site",

    "projet.1.client":"Entreprise leader de la location d'appartements entre particuliers en France.",
    "projet.1.description":"Moderniser le site avec des animations de qualité, un code plus léger en single page grâce à React, une interface utilisateur plus intuitive",
    "projet.1.objectif":"Refonte total du site réalisé il y longtemps en ASP.NET. Le but était de passer à une stack complète en JavaScript avec NodeJS côté back-end, et React côté front-end",

    "projet.2.client":"Particulier, Architecte d'intérieur",
    "projet.2.description":"Présenter les travaux de l'architecte, lui permettre de rajouter ou supprimer des projets une fois qu'elle se connecte",
    "projet.2.objectif":"Appel API afin de stocker les travaux, de pouvoir les supprimer ou bien en ajouter après que Sophie se soit identifié le tout en Javascript",

    "projet.3.client":"Start-up",
    "projet.3.description":"Développer un site Internet qui permette aux usagers de trouver des hébergements et des activités dans la ville de leur choix.",
    "projet.3.objectif":"Intégration de l'interface du site avec du code HTML et CSS d'après les maquettes desktop, tablette et mobile.",

    "projet.4.client":"Start-up New-yorkaise désirant s'installer sur le marchée Parisien",
    "projet.4.description":"Développer un site “mobile first” qui répertorie les menus de restaurants gastronomiques, avec de belles animations pour une meilleure expérience utilisateur",
    "projet.4.objectif":"En plus des systèmes classiques de réservation, les clients pourront composer le menu de leur repas pour que les plats soient prêts à leur arrivée. Finis, les temps d'attente au restaurant !",

    "projet.5.client":"Particulier, photographe professionel",
    "projet.5.description":"Améliorer et retravailler le site existant, rendre le site plus fluide. Augmenter le traffic grâce à un référencement local et un meilleur score SEO",
    "projet.5.objectif":"Ajouter un référencement local, travailler sur le format des images du site. Obtenir un score optimal sur l'audit Lighthouse",

    "projet.6.client":"Agence évènementielle",
    "projet.6.description":"Retravailler la logique du site, réalisé par un autre developpeur n'ayant pas eu le temps de finir",
    "projet.6.objectif":"Debugger les différents problèmes et réaliser des tests unitaires, d'intégration et un cahier de recette end-to-end afin d'optimiser parfaitement le site."



}


