
{
    "nav1":"About",
    "nav2":"Projects",
    "nav3":"Contact",

    "hero_title1":"Lucile,",
    "hero_title2":"web developpeur",
    "hero_text":"Always looking for new challenge I started by learning Javascript but I quickly felt a great interest in React and so I got my diploma in web development however I do not intend to stop there! Designing a site, starting from a few ideas on a piece of paper and then making models to finally see it take shape again is a real pleasure. I like to add small details to make each site a unique piece.",
    "hero_link":"Contact me",
    "hero_link_text":"and let's talk about your project !",

    "compet_title":"skills",
    "compet_text":"More skills to come!",

    "projet_title":"Projects",
    "projet_text":"Here are my projects to date, and those in progress. Find the link to the site or gitHub to learn more about each project.",
   
    "btn-tous":"All",
    "btn-plus":"See more",
    "btn-moins":"See less",
   
    "cv_title":"CV",
    "cv_text":"To know everything about my career, download my resume!",

    "contact_title":"Contact",
    "contact_text1":"To contact me",
    "contact_text2":"form",
    "contact_text3":"or my e-mail",
    "contact_text4":" are available so do not hesitate and contact me!",
    "input_name": "Name",
    "btn-envoyer": "Send",
    "btn-succes":"Your message has been sent. I would quickly come back to you!",
    "btn-error-send":"An error occurred when submitting the form.",
    "btn-error-form":"Please fill in all fields, so I can contact you again",

    "modal-lien-git":"Link to GitHub",
    "modal-lien-site":"Link to the website",

    "projet.1.titre": "Real estate rental web application with React",
    "projet.1.description":"Total redesign of the site to move to a full stack in JavaScript with NodeJS on the back-end side, and React on the front-end side. Development of the entire application, React components, React Router routes, following the Figma models (responsives). Data is retrieved dynamically from a JSON file. Animations are made with SASS",

    "projet.7.titre": "Dynamic web page with Javascript",
    "projet.7.description":"Website of a professional photographer. Including a presentation page of its projects recover from an API (Swagger) and which can be sorted through a filter, a login page of the site administrator, a modal to add new projects and store them and a modal to delete them. ",

    "projet.3.titre": "Home page of a travel agency",
    "projet.3.description":"Home page development in HTML and CSS. Responsive page according to figma models in desktop, tablet and mobile.",

    "projet.4.titre": "Mobile site with animation ",
    "projet.4.description":"Gastronomic restaurant site in mobile first. 4 menus are available and it is possible to mark your preference thanks to the heart icon. At the click of the menu the dishes appear with an animation made in SASS. An animation simulating a loading is present at loading. ",

    "projet.5.titre": "Optimize the SEO of a photographer site",
    "projet.5.description":"Site to show the work of a professional photographer with optimization problems causing problems for users. I realized: a global optimization of the site both on performance and SEO, the implementation of local referencing using Schema.org, the addition of metas for social networks, the optimization of the accessibility of the site and finally I recorded all the changes made in an optimization report.",

    "projet.6.titre": "Debugging the site of an event agency",
    "projet.6.description":"The site was started by a developer who had to leave. The site is functional, but some bugs hinder the good use by visitors. So I performed tests (integrations, units, end-to-end) to correct bugs and avoid future problems. I also made a recipe book. ",

    "projet.2.titre": "Challenge site e-commerce",
    "projet.2.description":"First challenge from the 'Front-end Mentor' website completed with React and Tailwind. The site is responsive (mobile, tablet, and desktop). Use of reusable components and props. Carousels behave differently in mobile and desktop versions. "
}

   
